{"abstract": "AdaBoost algorithm based on Haar-like features can achieves high accuracy (above 95%) in object detection. Meanwhile massive computing power is needed to implement the cascaded classifiers involved in AdaBoost detection. To solve this problem, several dedicated hardware solutions have been proposed for real-time applications. In this work, a novel heterogeneous architecture of an AdaBoost detector is presented. This architecture achieves higher performance while consuming fewer hardware resources. By combining an integrated ARM Cortex-A9 processor with a dedicated accelerator, this architecture can be configured to realize various objects detection by simply loading different parameters. 2-D parallelism is involved in accelerator unit combination which brings more flexibility. This scheme is implemented on Xilinx ZC702 platform, the experiment result shows that 40 QVGA frames per second can be achieved for real-time face detection. The accelerator achieves more than 13 times improvement over the OpenCV implementation on a standalone Cortex-A9 w.r.t execution speed. Meanwhile, the accelerator consumes 40% less FPGA hardware resources than the prior-art implementation.", "authors": ["Zheng Xu", "Runbin Shi", "Zhihao Sun", "Yaqi Li", "Yuanjia Zhao", "Chenjian Wu"], "n_citation": 0, "references": ["05944f08-b0df-47b8-bb44-23a63cf6a9a8", "1f4152a3-481f-4adf-a29a-2193a3d4303c", "3c2ddf0a-237b-4d17-8083-c90df5f3514b", "522ce553-29ea-4e0b-9ad3-0ed4eb9de065", "579e5f24-5b13-4e92-b255-0c46d066e306", "5d0b987d-eed9-42ce-9bf3-734d98824f1b", "80656b4d-b24c-4d92-8753-bdb965bcd50a", "d6e37fb1-5f7e-448e-847b-7d1f1271c574"], "title": "A Heterogeneous	System for Real-Time Detection with AdaBoost", "venue": "high performance computing and communications",	"year":	2016, "id": "001eef4f-1d00-4ae6-8b4f-7e66344bbc6e"}			
{"abstract": "In this paper, a kind of novel jigsaw EBG structure is designed and applied into conformal antenna array. The stop band of jigsaw EBG structure is simulated. And the 4-element antenna array with Taylor amplitude distribution is considered. The effect of EBG structure on the side-lobe level of antenna array radiation pattern is investigated.", "authors": ["Yufei Liang", "Yan Zhang", "Tao Dong", "Shan-wei Lu"], "n_citation": 0, "references": [], "title": "A novel conformal jigsaw EBG structure design", "venue": "international conference on conceptual structures", "year": 2016, "id": "002e0b7e-d62f-4140-b015-1fe29a9acbaa"}						
{"abstract": "This paper studies the problem of using an autonomous underwater vehicle (AUV) to seek the source of some signal in the underwater environment. To avoid the redundant travels for getting the local gradient in existing methods, we propose a novel source-seeking strategy in which the AUV keeps updating an estimated field model using measurements along its gradient-climbing path. Based on the convergence results of the sequential least-squares field estimation algorithm and the path planning method by nonlinear programming, the AUV will finally reach a maximum of the field which indicates a potential source. The way-point tracking control of the AUV is realized by a nonlinear model predictive control (NMPC) scheme embedded with the line-of-sight (LOS) guidance law. The effectiveness and efficiency of the proposed source-seeking strategy is validated in the simulation experiment with a real AUV model.", "authors": ["Xiaodong Ai", "Keyou You", "Shiji Song"], "n_citation": 0, "references": ["1862a08a-08c6-4ab1-a214-8932bbd0d2d9", "7bcea2f7-6006-4a4d-8529-3593fa56d2dc", "c1959b6f-8bab-49a2-ae2f-066c43cfc9c9", "d65d26b4-a0e0-4112-ae22-2f3a4b51d7b3", "e66104e4-31fd-43d6-a056-f52bf8ae7eee"], "title": "A source-seeking strategy for an autonomous underwater vehicle via on-line field estimation", "venue": "international conference on control, automation, robotics and vision", "year": 2016, "id": "00352759-f0a7-4678-82ae-fed68c700da6"}						
{"authors": ["Francine Berman", "Vinton G. Cerf"], "n_citation": 0, "references": [], "title": "Social and ethical behavior in the internet of things", "venue": "Communications of The ACM", "year": 2017, "id": "00f77fa9-ae49-4935-9166-2f5f9cdb3d6b"}						
{"authors": ["Leon A. Sakkal", "Kyle Z. Rajkowski", "Roger S. Armen"], "n_citation": 50, "references": ["4f4f200c-0764-4fef-9718-b8bccf303dba", "aa699fbf-fabe-40e4-bd68-46eaf333f7b1"], "title": "Prediction of consensus binding mode geometries for related chemical series of positive allosteric modulators of adenosine and muscarinic acetylcholine receptors", "venue": "Journal of Computational Chemistry", "year": 2017, "id": "013ea675-bb58-42f8-a423-f5534546b2b1"}						
{"authors": ["Nuno Moniz", "Luís Torgo", "João Vinagre"], "n_citation": 0, "title": "Data-Driven Relevance Judgments for Ranking Evaluation.", "venue": "", "year": 2016, "id": "01413023-7ed6-4964-b7c8-19259f84a1db"}						
{"abstract": "This paper presents a methodology to analyze linguistic changes in a given textual corpus allowing to overcome two common problems related to corpus linguistics studies. One of these issues is the monotonic increase of the corpus size with time and the other one is the presence of noise in the textual data. In addition, our method allows to better target the linguistic evolution of the corpus, instead of other aspects like noise fluctuation or topics evolution. A corpus formed by two newspapers, \"La Gazette de Lausanne\" and \"Le Journal de Gen\\`eve\", is used, providing 4 million articles from 200 years of archives. We first perform some classical measurements on this corpus in order to provide indicators and visualizations of linguistic evolution. We then define the concept of a lexical kernel and word resilience, to face the two challenges of noises and corpus size fluctuations. This paper ends with a discussion based on the comparison of results from linguistic change analysis and a concludes with possible future works continuing in that direction.", "authors": ["Vincent Buntinx", "Cyril Bornet", "Frédéric Kaplan"], "n_citation": 0, "references": ["426b57a8-2e7d-498d-9a57-c09983ae0699", "6499d572-7819-47bf-9087-bd201c31cea1", "db81cd6e-3a7a-4088-b254-92f924a4e379"], "title": "Studying Linguistic Changes over 200 Years of Newspapers through Resilient Words Analysis", "venue": "Frontiers in Digital Humanities", "year": 2017, "id": "01522369-3b88-4256-99d4-4e0c1de9f1ba"}						
{"abstract": "Boneh and Durfee (Eurocrypt 1999) proposed two polynomial time attacks on small secret exponent RSA. The first attack works when d  0.284  whereas the second attack works when d  0.292 . Both attacks are based on lattice based Coppersmith's method to solve modular equations. Durfee and Nguyen (Asiacrypt 2000) extended the attack to a variant of RSA where prime factors are not the same sizes. However, the attack extended only the first attack of the Boneh-Durfee. Hence, an open problem remains, i.e., if the Boneh-Durfee second attack can be extended to unbalanced RSA. In this paper, we propose a desired attack that extended the Boneh-Durfee second attack. Our proposed attack fully improves the Durfee-Nguyen attack for all size of prime factors. The improvement stems from our technical lattice construction. Although Durfee and Nguyen only analyzed lattices whose basis matrices are triangular, we analyze broader classes of lattices that contain non-triangular basis matrices. The analysis can be performed by using the unravelled linearization proposed by Herrmann and May (Asiacrypt 2009) and the transformation on the Boneh-Durfee lattices proposed by Takayasu and Kunihiro (PKC 2016). As a result, we can exploit useful algebraic structure compared with the Durfee-Nguyen.", "authors": ["Atsushi Takayasu", "Noboru Kunihiro"], "n_citation": 0, "title": "Small secret exponent attacks on RSA with unbalanced prime factors", "venue": "international symposium on information theory and its applications", "year": 2016, "id": "01537b60-9ae2-4684-a1fa-e688e7757e6f"}						
{"abstract": "Container identification and recognition is still performed manually or in a semi-automatic fashion in multiple ports globally. This results in errors and inefficiencies in port operations. The problem of automatic container identification and recognition is challenging as the ISO standard only prescribes the pattern of the code and does not specify other parameters such as the foreground and background colors, font type and size, orientation of characters (horizontal or vertical) so on. Additionally, the corrugated surface of container body makes the two dimensional projection of the text on three dimensional containers slanted and jagged. We propose a solution in the form of an end-to-end pipeline that uses Region Proposals generated based on Connected Components for text detection in conjunction with Spatial Transformer Networks for text recognition. We demonstrate via our experimental results that the pipeline is reliable and robust even in situations when the code characters are highly distorted and outperforms the state-of-the-art results for text detection and recognition over the containers. We achieve text coverage rate of 100% and text recognition rate of 99.64%.", "authors": ["Ankit Verma", "Monika Sharma", "Ramya Hebbalaguppe", "Ehtesham Hassan", "Lovekesh Vig"], "n_citation": 0, "references": ["001eef4f-1d00-4ae6-8b4f-7e66344bbc6e", "42f6b977-ec16-48be-a8f2-af53b8522be1", "46aeba51-c989-4cf8-927e-928dadcef872", "5647dca2-7978-40a9-bc7b-376d232a068a", "70d88ef5-1fe3-4df8-a9af-becc2bb17a75", "742181ff-4a0a-46ca-b32c-aab50dd7c3c7", "786b4b62-32d5-4be0-b7e3-aa5c3647d376", "9b2aa4f0-a196-46e3-8ab1-c7fd6788d9a4", "a9f2c948-4bb	2-4f19-9484-3a01cc4249fc", "afa0804e-da05-48f0-ade9-47996e4df4d2", "d19e9c93-9bb8-4936-9275-c7fbff937079"	, "e8f80	f7b-0406-4c69-b64d-fed6ef59ecc7", "e9743240-779d-4ff8-bb78-b778fa70171	3"],	"title":	"Automatic Container Code Recognition via Spatial Transformer Networks and Connected Component Region Proposals", "venue": "international conference on machine learning and applications", "year": 2016, "id": "017440d5-6ba8-422a-bd7a-d59e3b9a4e77"}
{"abstract": "This paper analyzes the current active Medical Tourism websites and discusses the availability of various features among these websites. The analysis is based on the collected data about the features' importance and users' online search patterns from people have experiences in Medical Tourism and medical information search on the Internet. This study focuses on the Medical Tourism market in Thailand due to its popularity and high ranking among other international Medical Tourism destinations. A Medical Tourism aggregative system is proposed by using one of the Data Mining tools - Association Rule.", "authors": ["Elaine Vedrasco", "Chidchanok Lursinsap"], "n_citation": 0, "references": ["472b9486-b98a-4972-8252-b1eacbaf52a7", "572457cf-fcf7-40ff-a72c-6776b00c6ef7", "76ce1455-926e-457b-8754-1b38d770ca08", "86623ef4-060b-421e-bb7f-d36a5e268d43", "866a428a-b24b-409d-af75-b31721572760", "97549697-2cbf-4ae0-92d5-38fa7fa25b58", "976b29e2-47bd-4a66-a36a-37f3e077fb95", "bf5b864a-08cc-4b32-a9da-dff8acd97f00", "e3f27652-688a-457b-ad96-07a7e3c05543"], "title": "Effective solution for a medical tourism aggregative system using the data mining approach", "venue": "", "year": 2016, "id": "01dcc2e7-fda1-483d-9a5c-10e9cf985951"}						
{"abstract": "For stereoscopic optical see-through head-mounted display calibration, existing methods that calibrate both eyes at the same time highly depend on the HMD user's unreliable depth perception. On the other hand, treating both eyes separately requires the user to perform twice the number of alignment tasks, and does not satisfy the physical structure of the system. This paper introduces a novel method that models physical structure as additional constraints and explicitly solves for intrinsic and extrinsic parameters of the stereoscopic system by optimizing a unified cost function. The calibration does not involve the unreliable depth alignment of the user, and lessens the burden for user interaction.", "authors": ["Long Qian", "Alexander Winkler", "Bernhard Fuerst", "Peter Kazanzides", "Nassir Navab"], "n_citation": 50, "references": ["076bca9b-b30c-4c2c-8148-3b9b5d9aa939", "6b5cf401-1b90-4d68-b44e-2fe6cc54c93f", "82db7f4a-3c8e-42c3-b852-41f751248251", "9a5f6827-098c-46ed-a4c7-ae0590dd2342", "fb5bde78-2255-469d-a735-adb8409a2715"], "title": "Modeling Physical Structure as Additional Constraints for Stereoscopic Optical See-Through Head-Mounted Display Calibration", "venue": "international symposium on mixed and augmented reality", "year": 2016, "id": "01f02fae-97df-4207-a386-a1bc8ec0853b"}						
{"abstract": "Without requiring time synchronization, protocol sequences can be used to design a simple and reliable channel access protocol for mobile ad hoc networks. This paper focuses on completely irrepressible (CI) sequences, which can be employed to allow each user to have at least one successful packet transmission within each sequence period for a completely asynchronous channel. Previous numerical studies have shown by using carefully designed CI sequences, the average delay performance can be improved than using ALOHA-type schemes. To gain a unique insight into the characteristics of the protocol, we present an analytical model for the delay performance of CI sequences. The accuracy of our analytical model is verified via numerical results.", "authors": ["Aijie Zou", "Yuxuan Fang", "Fengyu Guan", "Yijin Zhang", "Chang-Hong Fu", "Hongyuan Chen", "Feng Shu"], "n_citation": 0, "references": ["0b92c76b-86f0-4b8b-a0ff-138cbae8340f", "0d11abd8-c2f8-489f-bf87-234bd0dab697", "115b2803-a506-42f3-8b2c-f91f7e599dee", "2de3834f-ebc5-41b8-aba7-748a3e013a2e", "2fdfb2a1-59ec-4aeb-97fc-40fc9fbe90ec", "4f183e41-3270-4345-9234-3070ea2e4406", "7decfb83-998e-4bad-a36d-09380ca810ff", "d0b8fa14-ad90-4625-8829-df4c4aeca28a", "d10f36a0-8604-4b03-a290-a31c5f4e5cd1", "d3e031ae-0189-4c87-8600-dea5d98f3224", "dfb5d5e2-5e2b-40bc-8e3d-7321220a044e", "f51e9623-aa6c-4878-858d-8de7cf43eec9", "fda171de-9fe9-4e7e-88b1-05f4b9ba1a2a"], "title": "Delay analysis of completely irrepressible sequences for mobile ad hoc networks", "venue": "international conference on conceptual structures", "year": 2016, "id": "029bb71a-6b91-43a5-8a83-ce56b544204b"}						
{"authors": ["Ioanna Ersi Pervolaraki", "Emmanouel Garoufallou", "Rania Siatri", "Georgia Zafeiriou", "Sirje Virkus", "Stavroula Antonopoulou"], "n_citation": 0, "references": ["2151fe5c-ec30-40d5-bf75-a428b1be8250", "e719a43c-1a1c-4c2f-83b0-66227fab2012"], "title": "Use of Digital Tools by Preschool Children: Preliminary Results.", "venue": "", "year": 2016, "id": "02a643f8-93f3-469f-8c24-2ffc5c9b7129"}						
{"authors": ["Kazuhiro Homma", "Kiyoyuki Chinzei", "Koji Hyodo"], "n_citation": 0, "title": "MR Imaging Method for Measurement of Local Dynamics in Human Tissues.", "venue": "", "year": 1994, "id": "02e81c9e-f2ae-4335-b2e2-416eb95df3ac"}						
{"abstract": "This work establishes a scalable, easy to use and efficient approach for exploiting SIMD capabilities of modern CPUs, without the need for extensive knowledge of architecture specific instruction sets. We provide a description of a new API, known as UME::SIMD, which provides a flexible, portable, type-oriented abstraction for SIMD instruction set architectures. Requirements for such libraries are analysed based on existing, as well as proposed future solutions. A software architecture that achieves these requirements is explained, and its performance evaluated. Finally we discuss how the API fits into the existing, and future software ecosystem.", "authors": ["P. Karpiński", "John McDonald"], "n_citation": 0, "references": ["65cbef5a-007f-436f-9044-ffc09b1d2df1", "aac1e6b2-a2c2-45c1-8935-bcc96680cd23", "cafafa28-f85a-4331-917c-8851ea044826", "e0f45975-a3d5-4b84-b106-93ce2e198e6b"], "title": "A high-performance portable abstract interface for explicit SIMD vectorization", "venue": "", "year": 2017, "id": "0361b05e-9bca-42d1-af6c-49905e5eb7cb"}						
{"abstract": "Transforming deterministic $\\omega$-automata into deterministic parity automata is traditionally done using variants of appearance records. We present a more efficient variant of this approach, tailored to Rabin automata, and several optimizations applicable to all appearance records. We compare the methods experimentally and find out that our method produces smaller automata than previous approaches. Moreover, the experiments demonstrate the potential of our method for LTL synthesis, using LTL-to-Rabin translators. It leads to significantly smaller parity automata when compared to state-of-the-art approaches on complex formulae.", "authors": ["Jan Křetínský", "Tobias Meggendorfer", "Clara Waldmann", "Maximilian Weininger"], "n_citation": 0, "references": ["0c781683-b162-45b5-8a0a-5188238ef1c6", "3ebf499b-c870-4256-9721-12d53f86c4ed", "5fc26abc-4325-415e-9ded-fb84cee2cfc8", "5fffd378-7385-425c-a445-f17380db02c9", "737eb6ec-5c86-4e63-baca-fadaf07d4046", "74e3fd8b-f955-4fde-aad8-0a705f05e27e", "83fa4cb3-9d63-4045-bfc2-06bfa8eec305", "98f75cd7-a8d9-4aa2-aedf-17854c31b90a", "a35929d4-2cf6-443b-935b-98150de57b56", "a683136e-1411-431b-8257-507891fff09a", "b7143e77-0b05-4448-9bfe-02a6323532b2", "d566771b-688d-46c1-9588-7f611deb4238", "df8ed6f9-a3b0-4d26-83a1-6eb1e025f870", "ecc7c034-f91e-4a75-9b6b-630e93503a1a", "f2d7e368-8a58-4e5c-826d-fa714cc000f8", "fd9ddd9d-583f-4eb6-8cbe-90722c8587a1"], "title": "Index Appearance Record for Transforming Rabin Automata into Parity Automata.", "venue": "tools and algorithms for construction and analysis of systems", "year": 2017, "id": "037d2e92-a3b1-406e-a344-a9fbd8c57bc5"}						
{"abstract": "The relevance of local knowledge in cultural heritage is by now acknowledged. It helps to determine many community-based projects by identifying the material to be digitally maintained in multimedia collections provided by communities of volunteers, rather than for-profit businesses or government entities. Considering that the search and browsing of texts, images, video, and 3D models related to places is more essential than using a simple text-based search, an interactive multimedia map was implemented in this study. The map, which is loaded on a single HyperText Markup Language (HTML) page using AJAX (Asynchronous JavaScript and XML), with a client-side control mechanism utilising jQuery components that are both freely available and ad-hoc developed, is updated according to user interaction. To simplify the publication of geo-referenced information, the application stores all the data in a Geographic JavaScript Object Notation (GeoJSON) file rather than in a database. The multimedia contents—associated with the selected Points of Interest (PoIs)—can be selected through text search and list browsing as well as by viewing their previews one by one in a sequence all together in a scrolling window (respectively: “Table”, “Folder”, and “Tile” functions). PoIs—visualised on the map with multi-shape markers using a set of unambiguous colours—can be filtered through their categories and types, accessibility status and timeline, thus improving the system usability. The map functions are illustrated using data collected in a Comenius project. Notes on the application software and architecture	are also presented in this paper.", "authors": ["Nicola Maiellaro", "Antonietta Varasano"], "n_citation"	: 0, "re	ferences": ["49365bcd-f1aa-4f6e-9ab2-597d0fcfc28f", "5baa4a60-4a82-49c	Aug-84	b4-340312	03df26"], "title": "One-Page Multimedia Interactive Map", "venue": "", "year": 2017, "id": "0391f5e3-13f4-4984-afbc-82ebd59c5936"}
{"authors": ["Marta Nuñez-Garcia", "David Andreu", "Marta Male", "F.J. Alarcón", "Lluis Mont", "Constantine Butakoff", "Oscar Camara"], "n_citation": 0, "references": ["456717b7-c5f9-4d65-a2e6-83ce70378c5f", "7ea2c02c-c3cf-4a1e-8281-09f1f38599f7", "a5378aed-4361-47ee-8ae7-584b8c3b669d", "d66a68b3-c72b-4d4b-b406-57f3a6547bb1"], "title": "Standardised Framework to Study the Influence of Left Atrial RF Catheter Ablation Parameters on Permanent Lesion Formation", "venue": "", "year": 2016, "id": "03c06fcc-017a-4138-81f4-86f7237cabfd"}						
{"abstract": "In this work, we consider a Zigbee wireless sensor network and study the effect of different network topologies on quality of service metrics such as throughput, end-to-end delay, and packet dropping. A campus building is selected as an experimentation testbed, where several end devices are placed, together with routers and a single coordinator. In this setup, the performance of Zigbee communication protocol was simulated using the OPNET Modeler simulation tool. Measurements of QoS metrics were obtained under different topologies, in order to quantify the complex effects of topology control on aggregate load, throughput, delay, and packet dropping. The results suggest that an increase in the number of routers in the network leads to a significant increase in network load and end-to-end delay, but at the same time offers higher throughput and minimum number of dropped packets.", "authors": ["Maria Dimou", "Theofilos Kossyvakis", "Costas Chaikalis", "Konstantinos P. Tsoukatos", "Charalampos Liolios", "Vasileios Vlachos"], "n_citation": 0, "references": ["35fc2508-4727-4ae9-a00c-8c00e70a9a80", "b2ccb628-0c27-48cf-8b5e-291ab25b9117", "d44dd4fe-ca1d-4fde-855a-1548de68b836", "dfc9f1b0-a952-42e2-bc5e-c5d78c053d2d", "f93520e8-c84e-4c9e-b6ad-bd8892ae5bd0"], "title": "Topology Experimentation in a Zigbee Wireless Sensor Network", "venue": "panhellenic conference on informatics", "year": 2016, "id": "03d34ab5-a275-444e-a85b-c46f09c357f0"}						
{"abstract": "Ever-evolving malware continues to flood the Internet at an alarming rate. This makes it challenging for security organizations and anti-malware vendors to devise effective solutions. It is, therefore, imperative to study automated tools and techniques for quick detection of malware, possibly limiting or preventing any impact on the target. The code or behavioural patterns obtained from malware analysis can be used to classify new malware samples into their existing families and recognize those which possess unknown behaviour and thus need a closer manual inspection. This paper provides a comprehensive review of techniques and tools currently employed for malware analysis and classification. It includes the comparison of tools and techniques for collecting malware, analyzing them statically and dynamically for extracting features and finally classifying these using machine learning methods. It also provides the examples from the literature that analyze executables for extracting useful features and apply machine learning for discriminating malicious software from benign ones.", "authors": ["Ekta Gandotra", "Divya Bansal", "Sanjeev Sofat"], "n_citation": 0, "title": "Tools & Techniques for Malware Analysis and Classification", "venue": "", "year": 2016, "id": "03f1c773-c072-4011-9455-1f34c64e929d"}						
{"authors": ["Erwan Bousse", "Manuel Wimmer", "Wieland Schwinger", "Elisabeth Kapsammer"], "n_citation": 0, "title": "On Leveraging Executable Language Engineering for Domain-Specific Transformation Languages.", "venue": "", "year": 2016, "id": "0458b983-901d-49c1-85f8-8aa1eacc8a8b"}						
{"abstract": "A network embedding is a representation of a large graph in a low-dimensional space, where vertices are modeled as vectors. The objective of a good embedding is to preserve the proximity between vertices in the original graph. This way, typical search and mining methods can be applied in the embedded space with the help of off-the-shelf multidimensional indexing approaches. Existing network embedding techniques focus on homogeneous networks, where all vertices are considered to belong to a single class.", "authors": ["Zhipeng Huang", "Nikos Mamoulis"], "n_citation": 0, "references": ["0613c93b-e309-4247-844c-15b8e651f7d6", "087f5698-5bf0-4a04-baa3-c13547b9e9f1", "12f40b38-cd99-4801-8074-d765a29a2101", "28994c1f-f220-4156-a6da-17cff4a55a61", "29dec249-248e-405e-95ad-25212dbca08f", "2e5c3b78-91b8-43d6-b2bb-bb2c861c564c", "51cfdd10-1566-4380-adae-3889630ebaf4", "5a7ff0d4-5f7e-4dfa-87ba-79044a7096e0", "5fbfc090-9a2c-43c5-a5c8-1deea2e4d30c", "71b62008-1731-4491-b34c-9f223bae846f", "72836b7e-edd1-4fb1-ac42-2306b646599c", "7f6f7910-fa04-4993-9fa7-eface233f45a", "8e5a5082-4516-4d61-9511-7b5a08011441", "914ab6f3-868b-45dd-baa8-7c160b687f54", "9bd3b8dd-728e-4476-a3b8-f7b08f51bb78", "9cad8f91-f755-49ee-8521-69cf39240b0f", "a5fc8aed-b007-4ed1-92ee-81fad0dc67d2", "c074b2bd-e180-4a80-8ae3-109ebff35e8f", "c186e8f6-42e1-4bb8-8fe3-039e0cd02532", "c5c591ef-2cb9-4eb9-9c06-f2b7b8725a73", "cbff2ff2-6b8f-425d-a5ef-aff0de9be3e5", "ccc91c53-bb9c-4b35-a09c-4407e34dfd35", "e20ac065-c949-4f62-81ce-8c9c9db36a8d", "f3756ece-68c5-4626-aa4f-35fe6f015c6c", "f6e6c928-7f9c-45e4-871a-8b428369f97c", "f9b6cdb9-cc7b-4981-a93d-b0b08a96285b", "fef6ba5f-dcc5-4355-a09f-140ab	a3637fe"], "title": "Heterogeneous Information Network Embedding for Meta Path based Proximity", "venue":	"arXiv:	Artificial Intelligence", "year": 2017, "id": "04cd6546-ed71-4fec-899	e-9e	411b75975	f"}
{"abstract": "Metaheuristics, such as Genetic Algorithms (GAs), and hyper-heuristics have been widely studied and applied in the literature. This led to the development of several frameworks to aid the execution and development of such algorithms. Consequently, the reusability, scalability and maintainability became fundamental points to be attacked by developers. Such points can be improved using Design Patterns, but despite their advantages, few works have explored their usage with metaheuristics and hyper-heuristics. In order to contribute to this research topic, we present a solution based on the Visitor pattern used to design genetic operators. A case study is presented with the Hyper-heuristic for the Integration and Test Order problem (HITO). This case study shows that the proposed solution can increase the reusability of the implemented operators, and also enable easy addition of new genetic operators and representations.", "authors": ["Giovani Guizzo", "Silvia Regina Vergilio"], "n_citation": 0, "references": ["16bc6bb0-748a-4272-ae22-32b5b1538321", "1d111ef9-6b14-4af7-b49b-f1a1a5c0f11a", "43cb5f98-9813-42ff-845b-0171a67943b0", "45913319-0e7c-42e4-8a25-ac2124c373f5", "72508eaa-e394-4e9c-8324-63ffb5a9cd7b", "7480f0fe-f18c-4ae9-b47a-0dc4340f927f", "7decfecd-eed2-4add-8b5d-726e9c50c244", "a74f9944-5d5f-4e70-ae6b-ad90c10b6502", "c4eb7c15-5002-4f0e-969a-56511496e88d", "cd42f327-6765-4767-969e-abfa55d58763", "d326127b-32ca-42f8-8194-856fb5b66fdb", "da25b6b0-9637-4422-9ad7-f766597785dc", "dca57849-52b1-495b-b142-33d1974c90f3", "f273d116-f7c4-486e-ba3c-bbefa620513d", "f7637c3e-5153-4d81-bb9c-dd4f2c8d4118"], "title": "Metaheuristic Design Pattern:	Visitor for Genetic Operators", "venue": "", "year": 2016, "id": "04d72bcc-7998-4a8d-8fe9-8ff3dab793a4"}					
{"authors": ["Dejana Golenko", "Kornelija Petr Balog", "Ljiljana Siber"], "n_citation": 0, "references": ["314357ce-ecbe-45ed-8c06-c55aa20afa4c"], "title": "Information Literacy Programs in the Field of Law: Case Study of Two Law Faculties in Croatia", "venue": "", "year": 2016, "id": "04e7b47e-af0b-40e6-8632-f5c79d494719"}						
{"authors": ["Lydia Y. Chen", "Robert Birke", "Evgenia Smirni"], "n_citation": 0, "references": ["4176c232-fa9d-4540-a778-d2fe285cd2ae", "84e25c01-d8a6-4408-8987-6e9ff310fc80", "9225b3b0-3151-460c-ab8d-0e697aecb896", "bf551944-acd9-4885-973c-d643810b543f", "cd4058f9-c324-4b8c-bdc0-db940cfbcdd7", "cd46bb67-0755-4fb4-ba84-086227c4f529"], "title": "State of Practice of Non-self-aware Virtual Machine Management in Cloud Data Centers", "venue": "", "year": 2017, "id": "054ee4ba-df31-4662-8869-cd842d0a3c1e"}						
{"abstract": "Betweenness centrality is a popular metric in social science, and recently it was adopted also in computer science. Betweenness identifies the node, or the nodes, that are most suitable to perform critical network functions, such as firewalling and intrusion detection. However, computing centrality is resource-demanding, we can not give for granted that it can be computed in real time at every change in the network topology. This is especially true in mesh networks that generally use devices with few computation resources. This paper shows that using the fastest state-of-the-art heuristic algorithm it is indeed possible to compute network centrality even in real, low-power networking hardware in a network made of up to 1000 nodes. Not only, observing the behavior of a real mesh network it shows that centrality does not need to be updated at every topology change, but it can be safely re-computed with an interval in the order of the tens of minutes. Our findings confirms that centrality can be effectively and successfully used as a building block for security functions in mesh networks.", "authors": ["Leonardo Maccari", "Quynh Nguyen", "Renato Lo Cigno"], "n_citation": 0, "references": ["03a2eb6c-8a96-468e-b79f-282d069a4824", "063390a2-f032-473b-9806-db49733becdd", "1dc91e45-5985-4fd5-b62c-2b2df7c22b30", "22ea44eb-8d96-4bfc-aea4-94362672b98f", "28d2789b-7924-470a-9ec7-34363e00c975", "2c8e7e31-db3c-4207-8b28-ee8e2910dd87", "2ea644c7-5598-40fb-8afa-043ab2bfd529", "46adcb49-cb4d-4370-b0d2-50ec87f27cc9", "555fc5aa-69a3-473f-b7a3-2a2e69deb835", "631fa5b4-ccd0-4f8d-81dd-5b27fb10052b", "7b2e7ba1-1bb4-4d21-8120-fa84a27b6e84", "84d108d4-c2a5-4	531-9dcf-39ede987bccf", "a2f6bc97-abdd-4f23-b2d1-7f57fab1429c", "b233c983-a938-4aeb-a375-d2900d101d24", "	bb0cf3d2	-3c83-465e-81df-c7f1bf7c7bd8", "befe08a2-967a-4846-a16a-db0f74d190c5",	"c5	74452b-32	e8-41e6-9c62-a9d3b05a5e6b", "c97e6efd-0469-4fcd-af6e-d9093fbb598f", "d49d8c12-a22d-41cb-bbed-3c03afd255eb", "ddcbdf0b-7da1-4ec0-80dd-be302a5fa8c3"], "title": "On the Computation of Centrality Metrics for Network Security in Mesh Networks", "venue": "global communications conference", "year": 2016, "id": "055c731d-eead-439a-bec4-f2028968cc31"}
{"abstract": "In this paper, we motivate the utility of framing very common data analysis and business intelligence problems as a problem in understanding the differences between two datasets. We call this framework the Difference-of-Datasets (DoD) framework. We propose a simple and effective method to help find the root causes of changes, i.e. “Why did the observed change happen?” or “What drove the observed change?”. Our method is based on a hypothesis test to detect the difference in the distributions of two samples, and is tailored to large-scale correlated binary data. We apply our method to several interesting scenarios, and successfully get insights to approach the fundamental reasons for unexpected changes. While our method originates from the concepts in A/B testing, it could be extended to all areas related to data science and business intelligence.", "authors": ["Paul Raff", "Ze Jin"], "n_citation": 0, "references": ["1f35f20b-a760-47b6-8877-4ed53b69f6a1", "30db7a2d-e7c0-4bf0-87d5-253e13ccac96", "3875b02b-0333-4433-8d97-c3105394c36d", "48e1100d-588d-4716-a728-4e7062a13e79", "657d6ff2-9d0b-4558-8eeb-e6991120ddf5", "7e374bc3-54f4-4a05-a467-f0e7dd3ec059", "92ccbc72-cbaf-4258-b839-ba34c61205d7", "cc7b3b77-fef5-48f5-863a-3bdaed3f43f3", "d740fce7-beef-407b-9160-9bf0f1d8baf4", "dec1020f-eb37-4f1d-80fc-b745138549c8", "ebc3e1a7-dc06-4a76-95a9-d721f2fbef05", "f55ba15e-33c9-463e-b403-100a8dd0a476"], "title": "The difference-of-datasets framework: A statistical method to discover insight", "venue": "", "year": 2016, "id": "05944f08-b0df-47b8-bb44-23a63cf6a9a8"}						
{"authors": ["Gregory W. Hislop", "Massood Towhidnejad", "William M. Marcy"], "n_citation": 0, "title": "Work in progress - Vertically integrated teams to inspire student interest in computing.", "venue": "", "year": 2011, "id": "05c04c97-a735-4f63-ac35-18a2f88d8cb4"}						
{"abstract": "Time-Triggered Ethernet (TTEthernet) improved from Avionics Full Duplex Switched Ethernet (AFDX) is supposed to enhance the determination by introducing time-triggered mechanism, while indeterminacy problem still exists in rate-constrained (RC) flows thus requiring worst-case latency analysis. Traditional network calculus model used for AFDX is not suitable for TTEthernet due to time-triggered (TT) flow mandatory competition for network resource. In this paper, we derive formula of traffic delay for RC flows in TTEthernet with intensive TT-schedule schema under the condition of preemption transmission mode, expand performance analysis scope to support multi-priority flows through assuming TT flow as the highest-priority RC flow when considering the pessimism of scheduling and verify the practicability of modified model by calculating its algorithmic complexity. Experiments show that our model gives effective latency upper bound which is slightly beyond exact value but no more than 16.7% and sustains rapid calculation for a real complicated network configuration within 3 seconds compared with other existing models.", "authors": ["Xuan Zhou", "Feng He", "Tong Wang"], "n_citation": 0, "references": ["001eef4f-1d00-4ae6-8b4f-7e66344bbc6e", "03b061cb-7a35-4636-9c99-509e20484747", "13c5e77b-b809-47c5-a5f8-b555a25dbd24", "3ee36ffd-3eb1-470c-8e96-ea173b0794cf", "56c0195f-6267-464b-b3c0-824aa08e374f", "57d658af-322f-4f0e-a513-233d18d4a0c6", "63679ba2-2da9-4ccb-9303-7f2a37a316ea", "6f82b075-1db0-4f45-8dc5-2493b9d7840a", "8bd55ba5-dda7-45a4-8982-f1f45d56a2eb", "ba392c68-9663-49e5-85b0-2e1e2c84300d", "bf369f96-eb45-4b95-8355-f35a8a8012c6", "edcc	5acc-91bf-4b59-96b5-eda6be35843a", "fdec83b0-ebd2-4605-869b-9862b666a157"], "title": "Using network calcu	lus on w	orst-case latency analysis for TTEthernet in preemption transmission m	ode"	, "venue"	: "", "year": 2016, "id": "05de0628-5f0d-4c54-a8df-986c135d0a7e"}
{"abstract": "For the multiterminal secret key agreement problem, new single-letter lower bounds are obtained on the public discussion rate required to achieve any given secret key rate below the secrecy capacity. The results apply to general source model without helpers or wiretapper's side information but can be strengthened for hypergraphical sources. In particular, for the pairwise independent network, the results give rise to a complete characterization of the maximum secret key rate achievable under a constraint on the total discussion rate.", "authors": ["Chung Chan", "Manuj Mukherjee", "Navin Kashyap", "Qiaoqiao Zhou"], "n_citation": 50, "references": ["19eb4d23-c01f-484a-ad86-0f1061622295", "205c230b-da88-43fb-b5ad-d1dbd89f9eed", "3f5b52ce-03c4-44f0-bc93-02af2d30ca9b", "5743fa09-b4a5-4005-97bf-6f6d60d7f53d", "773140de-2995-4e3e-8ed2-120bbd93c9e8", "7ae6cf1c-5599-4f00-a0d1-995e88b15948", "898d8fd3-f3df-4c60-b03d-49e40072f666", "a319b177-7776-4143-8e88-b548ddda5b8a", "ba835661-2272-444d-be20-e56862698536", "c5b4b17a-c74d-40ef-986b-40facda637ab", "c5c9633f-2313-4fe8-bb3d-f9df63423d3d", "f07a6e52-c17b-4254-99af-00dd1e3dc7a9", "fa7c6cca-fd3f-4764-9e1a-21f3fecc8b30"], "title": "Secret Key Agreement under Discussion Rate Constraints", "venue": "arXiv: Information Theory", "year": 2017, "id": "0600c67e-71a1-4ed2-913f-e9db02370de4"}						
{"abstract": "The development of Advanced Driver Assistance Systems (ADAS), such as pedestrian detection, requires real-time update rates at high image resolution. Hopefully, heterogeneous architectures with high computing performance have been developed for this purpose. To benefit from this hardware performance, different programming languages and acceleration frameworks have been developed. OpenVX framework provides a graph-based execution model to program image processing algorithms on heterogeneous platforms. In this work, we investigate OpenVX optimizations for computer vision applications. We examine how this framework responds to different data access patterns. We test three important optimizations of OpenVX: kernels merge, data tiling and parallelization via OpenMP. The contribution and the impact of each optimization on different data access pattern are explained.", "authors": ["Djamila Dekkiche", "Bastien Vincke", "Alain Merigot"], "n_citation": 0, "references": ["08082d24-4cf9-41d2-98f7-3ae85df297a8", "28323bfc-f269-4778-9927-60a5931e0bc1", "488a6295-0665-4039-9842-da199231e5e0", "56dedd88-8542-4ebe-9d96-05517a559593", "62d3ed95-18d5-4c3d-af89-b65b8eb35d36", "b1f52e8e-84c0-4d62-af2e-9bb392d711a7", "b3849367-0a36-4a57-8440-434a7c0fdcbb", "e14f07cb-6644-4e95-8c39-aab3c7038878"], "title": "Investigation and performance analysis of OpenVX optimizations on computer vision applications", "venue": "international conference on control, automation, robotics and vision", "year": 2016, "id": "06a4064e-54f7-4092-a7e0-a1bdddb00bc0"}						
{"abstract": "This paper describes the design of a distributed architecture to support an interactive, interoperable, and collaborative forest fire fighting simulation using High Level Architecture (HLA). Based on the Run-time Infrastructure (RTI) services which are specified in HLA and C++ application programming interface (API) of the RTI, The distributed virtual fire fighting environment provides a practical foundation to enhance interactivity, interoperability for distributed simulation.. Users can build new federation application by the way of the goal system reorganization. The key techniques, such as FOM/SOM design, system structure, running mechanism of simulation system are discussed.", "authors": ["Chongcheng Chen", "Liyu Tang", "Xiaogang Feng", "Kaihui Lin"], "n_citation": 0, "title": "A distributed forest fire fighting simulation system based on HLA", "venue": "Lecture Notes in Computer Science", "year": 2006, "id": "06a987df-b067-413f-9555-405885651245"}						
{"abstract": "Wheeled ground robots are limited from exploring extreme environments such as caves, lava tubes and skylights. Small robots that can utilize unconventional mobility through hopping, flying or rolling can overcome these limitations. Mul-tiple robots operating as a team offer significant benefits over a single large ro-bot, as they are not prone to single-point failure, enable distributed command and control and enable execution of tasks in parallel. These robots can complement large rovers and landers, helping to explore inaccessible sites, obtaining samples and for planning future exploration missions. Our robots, the SphereX, are 3-kg in mass, spherical and contain computers equivalent to current smartphones. They contain an array of guidance, navigation and control sensors and electronics. SphereX contains room for a 1-kg science payload, including for sample return. Our work in this field has recognized the need for miniaturized chemical mobility systems that provide power and propulsion. Our research explored the use of miniature rockets, including solid rockets, bi-propellants including RP1/hydrogen-peroxide and polyurethane/ammonium-perchlorate. These propulsion options provide maximum flight times of 10 minutes on Mars. Flying, especially hovering consumes significant fuel; hence, we have been developing our robots to perform ballistic hops that enable the robots to travel efficiently over long distances. Techniques are being developed to enable mid-course correction during a ballistic hop. Using multiple cameras, it is possible to reconstitute an image scene from motion blur. Hence our approach is to enable photo mapping as t	he robots travel on a ballistic hop. The same images would also be used for navigation and path planning.	Using o	ur proposed design approach, we are developing low-cost methods for su	rfac	e explora	tion of planetary bodies using a network of small robots.", "authors": ["Himangshu Kalita", "Ravi Teja Nallapu", "Andrew Warren", "Jekan Thangavelautham"], "n_citation": 0, "references": ["2ac527fa-fc6e-4414-be65-de025e7ee625", "30932642-fd17-4ae9-9a5b-90e67adcfe41", "53971141-d73b-470a-b322-e56b2f9f8714", "5bb2ad40-2470-423f-932e-6ea5f14919c6", "5c509353-74f0-409d-9889-372efb833ec9", "935c5f12-cb46-4e4d-b5e5-6e79169fb5d9", "9ace4e03-15e4-47b3-a2e0-99f32000e19e", "fab7171e-e625-4e69-924a-797d53cca541"], "title": "GNC of the SphereX Robot for Extreme Environment Exploration on Mars", "venue": "arXiv: Robotics", "year": 2017, "id": "071e1103-1b06-4671-8324-a9beb3e90d18"}
{"abstract": "We present a statistical generative model for unsupervised learning of verb argument structures. The model was used to automatically induce the argument structures for the 1,500 most frequent verbs of English. In an evaluation carried out for a representative sample of verbs, more than 90% of the induced argument structures were judged correct by human subjects. The induced structures also overlap significantly with those in PropBank, exhibiting some correct patterns of usage that are not present in this manually developed semantic resource.", "authors": ["Thiago Alexandre Salgueiro Pardo", "Daniel Marcu", "Maria Das Volpe Nunes"], "n_citation": 0, "title": "Unsupervised learning of verb argument structures", "venue": "Lecture Notes in Computer Science", "year": 2006, "id": "0764585b-fec1-4086-9751-643ef3902d52"}						
{"abstract": "Fundamental tradeoffs in green cellular networks with coexistence of machine-oriented and human-oriented traffic are investigated. First, we present a queuing system to model the uplink transmission of a green base station which serves two types of distinct traffic with strict requirements on delay and battery lifetime. Then, the energy-lifetime and energy-delay tradeoffs are introduced, and closed-form expressions for energy consumption of the base station, average experienced delay in data transmission, and expected battery lifetime of machine devices are derived. Furthermore, we extend the derived results to the multi-cell scenario, and investigate the impacts of system and traffic parameters on the energy-lifetime and energy-delay tradeoffs using analytical and numerical results. Numerical results show the impact of energy saving for the access network on the introduced tradeoffs, and figure out the ways in which energy could be saved by compromising on the level of performance.", "authors": ["Amin Azari", "Guowang Miao"], "n_citation": 0, "references": ["2eed0e90-d04b-4868-ae90-4dba91794542", "4d302826-cf75-4415-beb7-0b7f69bfe2a6", "75ff8e1a-4f62-4df7-8190-4b68cda69416", "7cdf9036-41b3-496e-a7fe-ca9f7858f6b9", "8c69d90c-4b18-4037-b17d-03c5672c2ed5", "99bb5ecc-47bd-4708-ab7c-5acd79291168", "aba4e267-b349-42f0-8e12-66734e4a0996"], "title": "Battery Lifetime-Aware Base Station Sleeping Control with M2M/H2H Coexistence", "venue": "global communications conference", "year": 2016, "id": "0794014e-c320-4aa7-99f8-bb1d34f86277"}						
{"abstract": "In this paper, we present a distributed economic dispatch strategy for a large-scale power system. At first, we treat each generator and load in the grid as an \"agent\". By decomposing the centralized optimization into optimizations at local agents, a scheme is proposed for each agent to iteratively estimate a solution of the optimization problem in a distributed manner. Due to the large number of the agents, the agents are sorted into several clusters and each cluster has a leader to communicate with the leaders of its neighboring clusters. The agents in the same cluster can conduct local optimization and communicate with its neighboring agents in parallel. After that, the leader agents of each cluster exchange their information simultaneously. It is shown that the estimated solutions of all the agents reach consensus of the optimal solution asymptomatically. Compared to our previous work in [14], where the leader agent in each cluster conducts the optimization in a sequential way, the proposed scheme in this paper allows them communicate and conduct optimization simultaneously, which greatly improves the algorithm efficiency. A case study implemented on IEEE 30-bus power system are discussed and tested to validate the proposed method.", "authors": ["Fanghong Guo", "Changyun Wen", "Lantao Xing"], "n_citation": 0, "references": ["15cdd1a5-b2f3-45c7-b6fa-332322aee56d", "2f3b5b57-18f9-4638-af40-be99c7d97f5a", "8e67f4af-bef4-408a-9cc8-65e9b4c407d9", "91b443c2-7d3e-457d-9c0e-a540be3a6aaf", "af9ac400-c5e0-4906-bccb-8ba67d05bc6b", "c2ac8dc5-eeda-4126-8bcd-428530c34502", "fd9ccab5-f1ff-479f-b10d-b974e670675c"], "title": "A distributed algo	rithm for economic dispatch in a large-scale power system", "venue": "international conference on control	, automa	tion, robotics and vision", "year": 2016, "id": "07a98052-2a9d-4787-8e	ac-0	c167cac65	be"}
{"abstract": "Massive Multiple-Input-Multiple-Output (M-MIMO) system is a promising technology that offers to mobile networks substantial increase in throughput. In Time-Division Duplexing (TDD), the uplink training allows a Base Station (BS) to acquire Channel State Information (CSI) for both uplink reception and downlink transmission. This is essential for M-MIMO systems where downlink training pilots would consume large portion of the bandwidth. In densely populated areas, pilot symbols are reused among neighboring cells. Pilot contamination is the fundamental bottleneck on the performance of M-MIMO systems. Pilot contamination effect in antenna arrays can be mitigated by treating the channel estimation problem in angular domain where channel sparsity can be exploited. In this paper, we introduce a codebook that projects the channel into orthogonal beams and apply Minimum Mean-Squared Error (MMSE) criterion to estimate the channel. We also propose data-aided channel covariance matrix estimation algorithm for angular domain MMSE channel estimator by exploiting properties of linear antenna array. The algorithm is based on simple linear operations and no matrix inversion is involved. Numerical results show that the algorithm performs well in mitigating pilot contamination where the desired channel and other interfering channels span overlapping angle-of-arrivals.", "authors": ["Yihenew Dagne Beyene", "Kalle Ruttik", "Riku Jäntti"], "n_citation": 0, "references": ["397d220e-8154-4729-b2e4-10af297c6da4", "99d4c119-b99d-4931-a343-dc048cd562ca", "a4f35f32-3bec-43f9-9570-81f6d8aedfeb", "ad93a8cf-7157-4e38-8028-6acf2850e67a"], "title": "Angular Dom	ain Data-Assisted Channel Estimation for Pilot Decontamination in Massive MIMO", "venue": "Mobile Informa	tion Sys	tems", "year": 2017, "id": "08005b30-d0de-4578-84a3-dafa9b34c787"}			
{"authors": ["Dalė Dzemydienė", "Saulius Maskeliūnas", "Giedrė Dzemydaitė", "Arūnas Miliauskas"], "n_citation": 0, "title": "Semi-Automatic Service Provision Based on Interaction of Data Warehouses for Evaluation of Water Resources", "venue": "Informatica (lithuanian Academy of Sciences)", "year": 2016, "id": "0820fe4c-099f-41ba-8b8c-9d633cbd783c"}						
{"abstract": "This paper introduces a performance evaluation method for algorithms that generates a depth map using an image from a stereo endoscopic camera for image processing of laparoscope operations. The depth image was created by using a space-time stereo method by illuminating various patterns on scenes consisting of models of the 3D-printed organ model and actual organs from a pig, and the ground truth image was generated for each sub-pixel unit to achieve high accuracy and high precision. Different algorithms were evaluated using the ground truth image data. The number of effective depth pixels compared to the ground truth and the distance error was measured from algorithms based on an edge-preserving filter as real-time algorithms and quasi-dense algorithms. This paper presents an analysis of each algorithm from its evaluation indices to determine which algorithm is appropriate to compute the depth map from laparoscopic images.", "authors": ["Jiho Chang", "Jae-chan Jeong", "Ho-chul Shin"], "n_citation": 0, "references": ["1f520d1a-5870-477d-85d7-0f50be690ea7", "3685b3bf-1b66-4cbf-ae23-3ade0eabd832", "555ad45d-a882-4a07-a5a6-41ddb65d3fc8", "b0b1fe69-89a7-4d70-ad62-15ddcbd767c2", "b1357d01-99b5-4abd-8fbb-6fc478b7b4a4", "db848f26-fa82-4824-bb6e-825c4fee6437"], "title": "Performance evaluation of depth map generation algorithm for stereo endoscopic camera", "venue": "", "year": 2016, "id": "08bec57f-c415-4614-b49d-a01db2f9e84a"}						
{"abstract": "This paper addresses the synchronization and state estimation problems for an array of coupled discrete-time stochastic complex networks (SCNs) with uncertain inner couplings in which time-varying delay is considered both in the network couplings and dynamical nodes. In particular, the uncertainties encountering in coupling terms are characterized by using the interval matrix approach. By constructing a suitable Lyapunov–Krasovskii functional and utilizing Kronecker product properties, a new set of sufficient conditions is established in terms of linear matrix inequalities to guarantee the synchronization of the addressed SCNs with a prescribed mixed  H  ∞  and passivity performance index. Moreover, the state estimation problem is then studied for the same SCNs with uncertain inner coupling strength and subsequently, the estimator is designed. More precisely, Schur complement, discrete-time Jensen’s inequality together with reciprocally convex combination approach are used to simplify the derivations in the main results. Finally, numerical examples are exploited to illustrate the effectiveness of the proposed synchronization and state estimation results.", "authors": ["R. Sakthivel", "M. Sathishkumar", "B. Kaviarasan", "S. Marshal Anthoni"], "n_citation": 50, "references": ["13a1ecb2-e3c6-40f0-b7a7-a1fe8390e0a3", "1454d5fa-84de-4e14-9c6e-23f61edfa1d9", "20f9b218-a4c7-4878-bdf2-3d52bb353601", "2bbe830e-a318-4fdc-9292-4d85738db32c", "37626e69-e0b2-4cf4-a309-86ac416dcd9b", "6c8bb875-2f98-47ce-a705-9a5bd852caa4", "787e74c3-d94e-4929-b501-9ed9fd1b6f6f", "7b2c56da-ca0b-4951-9069-129b7792b62b", "82e47334-1059-4a9e-a7b5-e7bcfd	322dc4", "9554cc4d-4d60-474b-a391-9ebcf63fa0c0", "b744d133-6e6e-4400-afed-a425975fa49b", "be056407-55df-4	e8f-9941	-98216ac8cd25", "cc7bcdc5-d631-498b-955e-f2d4683b4a61", "e80bbbe8-829f	-4ad	1-ac81-dd	1e913eba8c"], "title": "Synchronization and state estimation for stochastic complex networks with uncertain inner coupling", "venue": "Neurocomputing", "year": 2017, "id": "08ed3a9e-75a9-4f91-b318-c24cf56eb6e7"}
{"abstract": "Branch and bound is a well-known generic method for computing an optimal solution of a single-objective optimization problem. Based on the idea “divide to conquer”, it consists in an implicit enumeration principle viewed as a tree search. Although the branch and bound was first suggested by Land and Doig (1960), the first complete algorithm introduced as a multi-objective branch and bound that we identified was proposed by Kiziltan and Yucaoglu (1983). Rather few multi-objective branch and bound algorithms have been proposed. This situation is not surprising as the contributions on the extensions of the components of branch and bound for multi-objective optimization are recent. For example, the concept of bound sets, which extends the classic notion of bounds, has been mentioned by Villarreal and Karwan (1981). But it was only developed for the first time in 2001 by Ehrgott and Gandibleux, and fully defined in 2007.#R##N##R##N#This paper describes a state-of-the-art of multi-objective branch and bound, which reviews concepts, components and published algorithms. It mainly focuses on the contributions belonging to the class of optimization problems who has received the most of attention in this context from 1983 until 2015: the linear optimization problems with zero-one variables and mixed 0–1/continuous variables. Only papers aiming to compute a complete set of efficient solutions are discussed.", "authors": ["Anthony Przybylski", "Xavier Gandibleux"], "n_citation": 0, "references": ["003b2880-b83c-44bf-bee1-7ebfe5efb498", "01d9e9da-3620-4b9a-ab71-76863356f115", "05607e8c-4518-47f4-a1f4-008b54f042e5", "0a75eddd-3a89-4d	dc-adb9-32d3aa7f8b75", "0dd3aa6c-e22a-4757-a2aa-fabd23d36122", "1255b075-5b88-4895-90c1-eff2e058a104", "2	181e319-	f2d3-4117-b34f-3ea8957456b9", "24099c98-dae2-4404-a179-4092389037cb",	"2f1	38454-874	f-4cee-ae9f-b4329d14a5cb", "2f5fb9e2-94c4-4ba2-92d9-1c157ac7f98b", "3319b470-e3db-45f8-a067-824b0a6c308c", "5183a1dd-e591-4b22-985e-f5afe3387ca8", "602db22b-43ea-403c-81c7-514dffe0c1d6", "62acba83-9873-469d-96e5-5115cb8655d3", "6603ea38-9912-4b0f-8b25-0004f4229a23", "66eed1ac-0868-499c-b03c-f5ea17fe8eb6", "8007f0be-098f-489a-904b-87654998e137", "84c0f524-644c-4eaf-a130-59af33868c80", "8c307463-9eae-43df-ae00-8a416aa26dbc", "9c40f7c7-752e-476c-acc1-2f0a0ccb3b46", "b3da1ad1-6b7c-47e8-b804-e98b74c78b03", "b7cd90c7-7eba-4b87-a9d9-d1f21ad96aa6", "bb1945f6-6e79-4e44-9ffa-15e709b7382d", "c06710ea-4061-4dc4-913f-130db1ea8f2a", "c50336e1-6fd9-4182-a747-6b686bbf4bb2", "c771b0d7-ae7a-4429-8ddc-48db730634e1", "c80550f5-5801-48b1-a6e3-161bf584b145", "e3178375-38b3-43c9-95b9-322f4a9ec01f", "f07ffef1-d0fa-4c85-87cf-8c74f5c30941", "f7d1c4ea-71e2-47ff-af13-e4e14ce7e0b6"], "title": "Multi-objective branch and bound", "venue": "European Journal of Operational Research", "year": 2017, "id": "093e387e-9041-420d-8ed6-612e7bc6e916"}
{"abstract": "Self-reconfigurable modular robots (SRMRs) have recently attracted considerable attention because of their numerous potential applications in the real world. In this paper, we draw a comprehensive comparison among five different algorithms in path planning of a novel SRMR system called ACMoD through an environment comprised of various terrains in a static condition. The contribution of this work is that the reconfiguration ability of ACMoD has been taken into account. This consideration, though raises new algorithmic challenges, equips the robot with new capability to pass difficult terrains rather than bypassing them, and consequently the robot can achieve better performance in terms of traversal time and energy consumption. In this work, four different optimization algorithms, including Adaptive Genetic Algorithm, Elitist Ant System, Dijkstra and Dynamic Weighting A*, along with a well-known reinforcement learning algorithm called Q-Learning, are proposed to solve this path planning problem. The outputs of these algorithms are the optimal path through the environment and the associated configuration on each segment of the path. The challenges involved in mapping the path planning problem to each algorithm are discussed in full details. Eventually, all algorithms are compared in terms of the quality of their solutions and convergence rate.", "authors": ["Sajad Haghzad Klidbary", "Saeed Bagheri Shouraki", "Soroush Sheikhpour Kourabbaslou"], "n_citation": 0, "references": ["070f917c-d01e-435f-9466-bf8eaa002def", "288106a6-f48d-44c2-98fb-bd4c257d6ff5", "293971a9-15e0-4a32-9c76-8a9704e304c2", "30932642-fd17-4ae9-9a5b-90e67adcfe41", "388	470d9-49db-42ce-97c8-f863fcc5f989", "42a65ef2-922f-44d4-b8a7-963b3a35b4cf", "5d491211-2de2-4b7a-8f9a-94b7	18e51e0d	", "64166868-cc56-4d33-aba9-1168b22131a1", "76eddd5c-8eab-49e5-8925-b5	26bc	9d2c65",	"7cd8c97b-ae4f-45e2-b87f-5e2a5f4b1c6d", "842dc017-aaf8-45e5-9dc3-62cf2dedcc7f", "8a70ef11-bd1a-4de7-87c8-4b40831b70d7", "99c52db0-e715-49a6-bf57-9b18aeb2240c", "9a2ad1c6-9e8e-4b4d-8143-303ab5b52970", "a0beec2b-ec67-4a11-b778-c6a0146c05d0", "b08b7edd-e1d0-4662-844e-2b68c4554730", "b50f8b0f-53d9-4883-a00c-53dd85ecafbf", "bd5ca86e-a109-4943-900d-ef51205292bf", "c18519d5-7c06-4328-b720-b9865e1874a1", "cd544da7-c66a-4369-ad4b-d0bb0e386ab1", "cfa66079-4432-46e3-bf49-8c7275236f4f", "d162ceec-58d3-43a2-b3e7-712ce57fa684", "d1b9e902-d3a5-4914-b1c2-2e7351d81205", "e0f3a738-4ab2-40d1-ba44-506d81c1d230", "ef951512-07f8-4ff4-8716-65e4e087c784", "f2ac32ce-68c4-4e57-b7ec-2ff91e46bc24", "fdfa51dd-5732-4297-aeba-9991aa9bd2c7"], "title": "Path planning of modular robots on various terrains using Q-learning versus optimization algorithms", "venue": "Intelligent Service Robotics", "year": 2017, "id": "0977ddfd-d01a-46cd-93e4-a101757dd1e0"}
{"authors": ["Fabrizio Dabbene"], "n_citation": 0, "title": "Optimal control, an introduction: Arturo Locatelli, Birkhäuser, London, Basel, 2000, ISBN 3-7643-6408-4.", "venue": "Automatica", "year": 2004, "id": "09a53601-06e4-4f7e-bf98-06ed1ae0b35e"}						
{"abstract": "In mobile robotic applications, a common problem is the following of a given trajectory with a constant velocity. Using standard model predictive control (MPC) for tracking of time varying trajectories leads to a constant tracking error. This problem is modelled in this paper as quadrotor position tracking problem. The presented solution is a computationally light-weight target position control (TPC), that controls the tracking error of MPCs for constantly moving targets. The proposed technique is assessed mathematically in the Laplace domain, in simulation, as well as experimentally on a real quadrotor system.", "authors": ["Jan Eric Dentler", "Somasundar Kannan", "Miguel Angel Olivares Mendez", "Holger Voos"], "n_citation": 0, "references": ["02e5b03a-5388-4faf-ab4e-b3523ad39081", "09d5c2b5-78bc-4381-a157-f80c69312f05", "17ff45ca-2373-4d3b-b487-a975d02cfbf9", "45cb1359-df7f-40bf-b698-98d1f0e2d7f4", "c2497cff-5b9f-4a9f-937d-20f92c2fef09"], "title": "A tracking error control approach for model predictive position control of a quadrotor with time varying reference", "venue": "robotics and biomimetics", "year": 2016, "id": "09e659aa-7446-43f4-bc1b-576d601aa402"}						
{"abstract": "Prioritization of new requirements to implement in software is a key point for maintenance and preservation of quality, observing business rules and standards of the company. The tools for prioritization, based on probed and recognized techniques require pre-qualify each requirement. If the company has several requests from customers of a product, increase the factors that affect it. The tools do not include these aspects of the complex task of qualifying. This research started with a survey of the methods of prioritization and selection of new requirements used by software development companies in the area of Rosario; and culminated with the definition of a methodology for prioritization of new requirements. These involves the analysis and evaluation of all the factors and consequences of implementing the selected requirements in the software product. The methodology includes the financial criteria and business rules of the company, and other quality values defined by its managers.", "authors": ["Sara De Federico", "Silvio Gonnet"], "n_citation": 0, "title": "New requirements prioritization based on customer historical profiles", "venue": "", "year": 2016, "id": "09faae8b-699a-45d6-b6a2-02d7c3f4fbad"}						
{"abstract": "We are delighted to present the 2016 11 th  International Design and Test Symposium (IDT) which is organized this year in Hammamet city, Tunisia, December, 18–20, 2016.", "authors": ["Mohamed Abid", "Yervant Zorian"], "n_citation": 0, "title": "Welcome to the IDT 2016", "venue": "Intelligent Decision Technologies", "year": 2016, "id": "0a06cb96-5255-486e-9e4b-3059b04e3aa2"}						
{"abstract": "While hardware transactional memory (HTM) has recently been adopted to construct efficient concurrent search tree structures, such designs fail to deliver scalable performance under contention. In this paper, we first conduct a detailed analysis on an HTM-based concurrent B+Tree, which uncovers several reasons for excessive HTM aborts induced by both false and true conflicts under contention. Based on the analysis, we advocate Eunomia, a design pattern for search trees which contains several principles to reduce HTM aborts, including splitting HTM regions with version-based concurrency control to reduce HTM working sets, partitioned data layout to reduce false conflicts, proactively detecting and avoiding true conflicts, and adaptive concurrency control. To validate their effectiveness, we apply such designs to construct a scalable concurrent B+Tree using HTM. Evaluation using key-value store benchmarks on a 20-core HTM-capable multi-core machine shows that Eunomia leads to 5X-11X speedup under high contention, while incurring small overhead under low contention.", "authors": ["Xin Wang", "Weihua Zhang", "Zhaoguo Wang", "Ziyun Wei", "Haibo Chen", "Wenyun Zhao"], "n_citation": 0, "references": ["0131c113-559f-42da-94e3-f5fc60ddb16e", "014e3b46-0c40-4d59-afe3-602b7e08ed22", "0f065892-4430-4628-b5c6-aec574869be1", "16e9c2b2-5978-41d1-86f0-3f91ea2095fe", "20c1a651-ec20-44cc-bd6d-b5982a0f3e55", "234cc65d-a11c-40c3-b61e-1d4697c69e61", "2a25de10-ea33-410c-8f32-69feae4030ab", "3028bf0f-26d5-4275-9f03-038683080f39", "3c9affe5-a987-43bd-89a9-68eb9762659b", "4799a163-054c-4575-85fe-2a513b0cbfc9", "482b77a6-2d75-419b-9805-5dfc1e5b6e10", "495bc3e	b-10d7-4e1a-96c1-8c247b3d6e74", "590d20e9-d235-4939-b1c8-b8ccc345d45b", "6158ba15-c196-4163-a899-872f1ce0	e9fc", "	646ddcd4-0547-427b-9451-f84400bd18b2", "690e99b1-52db-44cd-b6ce-38008d	4dc7	61", "699	fd50e-7da0-4d25-a3e2-1ec6275d630f", "6e6f92d1-ae41-4680-b9fb-ed284d7f3ca0", "85e460ac-801d-465d-b71d-145de98060cf", "86994343-85ab-4a6e-9636-0a485ed49af7", "8f662192-4b14-47e6-bcf1-24d6ea9703f6", "984f547c-d135-4cf8-b85e-7315f571b4aa", "99ecce31-28e7-4d23-aa5b-23b72db095ac", "9b23dcb1-20f3-419e-bae4-56c5b73bf27f", "bea81637-19be-47c8-a328-1484dbc7a033", "c177b850-1275-4b3b-953d-5d7791bfea5b", "cc76cc26-3128-44a3-8c50-d692b9031790"], "title": "Eunomia: Scaling Concurrent Search Trees under Contention Using HTM", "venue": "acm sigplan symposium on principles and practice of parallel programming", "year": 2017, "id": "0a070f4c-5077-4610-adb8-6be5538617c5"}
{"abstract": "Antenna switch enables multiple antennas to share a common RF chain, thus an additional spatial dimension, i.e., antenna index, can be utilized in the design of single RF chain MIMO and information can be conveyed via both signal space and spatial dimension. In this paper, we propose a unified adaptive transmission scheme - adaptive spatial modulation that allocates information into signal space and spatial dimension in order to maximize the overall channel capacity for single RF chain MIMO. The proposed adaptive spatial modulation is realized by using Huffman coding, i.e., designing variable length codes to activate the transmit antenna with different probabilities. The optimal antenna activation probability is derived through optimizing channel capacity. To make the optimization tractable, closed form upper bound and lower bound are derived as the effective approximations for channel capacity. Numerical results show that the proposed adaptive spatial modulation offers considerable performance improvement over both spatial modulation and transmit antenna selection.", "authors": ["Wei Wang", "Wei Zhang"], "n_citation": 0, "references": ["19392837-7972-4aa7-a860-d6c90458f7b8", "4f48b371-d692-4a79-ad46-a9159dfdd672", "748a2ab3-8b5f-4d0a-9e2d-af685089843a", "870d11c0-8636-4f9a-b265-1016474bebff", "b4022bac-a157-4a3a-9cab-050b7c5a49c3", "c9c5a9c0-f1b7-4286-8538-13476ae32e60"], "title": "Adaptive Spatial Modulation Using Huffman Coding", "venue": "global communications conference", "year": 2016, "id": "0a13520f-b058-43ff-ad3b-5e292422887e"}						
{"abstract": "Semantic image segmentation is a fundamental task in image understanding. Per-pixel semantic labelling of an image benefits greatly from the ability to consider region consistency both locally and globally. However, many Fully Convolutional Network based methods do not impose such consistency, which may give rise to noisy and implausible predictions. We address this issue by proposing a dense multi-label network module that is able to encourage the region consistency at different levels. This simple but effective module can be easily integrated into any semantic segmentation systems. With comprehensive experiments, we show that the dense multi-label can successfully remove the implausible labels and clear the confusion so as to boost the performance of semantic segmentation systems.", "authors": ["Tong Shen", "Guosheng Lin", "Chunhua Shen", "Ian D. Reid 0001"], "n_citation": 50, "references": ["031bbeb0-4dc1-46f9-9984-109c3b3eefae", "153c5014-dc7a-44a8-a93f-5cd27f1193df", "176a7436-78ea-4c2a-82e6-7930ab023bd1", "19d46c45-9aae-4fb4-8faa-1c4aab897468", "1ee6c6af-f18f-4b88-8d66-db763bc6f864", "23cddb94-a0fd-4711-b5c7-3c12e44545fe", "28d47fcd-4f94-4de9-b57b-99ba4545b867", "42efaf01-c82e-4d9f-a09a-bcc7a89e9593", "5e5f0f16-9885-46cb-9c54-8c92803f3874", "62de2ab7-adfd-4b2f-b7c9-3d91ebb1f0ee", "7091292e-20a5-44ae-bd53-b423c30f08cb", "72640ec0-e5e8-4b68-9508-f8a7edfcc343", "7d479bda-f8ab-4c55-8a7a-fd44b439e9e3", "83c737b8-e084-4766-ba6e-131e6a1c017c", "95c111f4-55d0-455e-884a-4485ff03b494", "ec26a04b-fff3-41c3-a52b-cebdaca61243", "f96b05ce-e0b1-4c26-929e-1fe675c4b4e3"], "title": "Learning Multi-level Region Consistency with Dense Multi-label	Networks for Semantic Segmentation", "venue": "arXiv: Computer Vision and Pattern Recognition", "year": 2	017, "id	": "0a2562d0-f2af-47e1-a783-02aac8607c7b"}			
{"abstract": "This paper focuses on modeling ride requests and their variations over location and time, based on analyzing extensive real-world data from a ride-sharing service. We introduce a graph model that captures the spatial and temporal variability of ride requests and the potentials for ride pooling. We discover these ride request graphs exhibit a well known property called densification power law often found in real graphs modelling human behaviors. We show the pattern of ride requests and the potential of ride pooling for a city can be characterized by the densification factor of the ride request graphs. Previous works have shown that it is possible to automatically generate synthetic versions of these graphs that exhibit a given densification factor. We present an algorithm for automatic generation of synthetic ride request graphs that match quite well the densification factor of ride request graphs from actual ride request data.", "authors": ["Abhinav Jauhri", "Brian Foo", "Jerome Berclaz", "Chih Chi Hu", "Radek Grzeszczuk", "Vasu Parameswaran", "John Paul Shen"], "n_citation": 0, "references": ["1079e0ff-5b82-466a-8a4d-888070e0fbd2", "24861225-3105-4832-addb-a546909650b0", "58600378-8e31-4103-8feb-69f2d3f97606", "68faab18-b537-4f62-85cf-ddc9ef352362", "713ca1b9-71b6-48e9-bcf3-156b6dcae8f4", "e7f6b8b1-4fdc-48df-876f-67859ed4d5cf", "f75e49b7-bd64-41a1-bba4-b744c67ba062"], "title": "Space-Time Graph Modeling of Ride Requests Based on Real-World Data", "venue": "arXiv: Artificial Intelligence", "year": 2017, "id": "0a94673d-9653-4c2a-bfee-e7f7bd41cb46"}						